In [36]:
import pandas as pd
import numpy as np

In [42]:
# load text file and seperate them with '\t'
np.loadtxt('worker.txt',dtype='str',delimiter='\t')

array([['1', 'Monika', 'Arora', '100000', '2014-02-20 090000', 'HR'],
       ['2', 'Niharika', 'Verma', '80000', '2014-06-11 090000', 'Admin'],
       ['3', 'Vishal', 'Singhal', '300000', '2014-02-20 090000', 'HR'],
       ['4', 'Amitah', 'Singh', '500000', '2014-02-20 090000', 'Admin'],
       ['5', 'Vivek', 'Bhati', '500000', '2014-06-11 090000', 'Admin'],
       ['6', 'Vipul', 'Diwan', '200000', '2014-06-11 090000', 'Account'],
       ['7', 'Satish', 'Kumar', '75000', '2014-01-20 090000', 'Account'],
       ['8', 'Geetika', 'Chauhan', '90000', '2014-04-11 090000', 'Admin']],
      dtype='<U17')

In [43]:
# create an datafram
pd.DataFrame(np.loadtxt('worker.txt',dtype='str',delimiter='\t'),columns=['worker_id','first_name','last_name','salary','joining_date','department'])

  worker_id first_name last_name  salary       joining_date department
0         1     Monika     Arora  100000  2014-02-20 090000         HR
1         2   Niharika     Verma   80000  2014-06-11 090000      Admin
2         3     Vishal   Singhal  300000  2014-02-20 090000         HR
3         4     Amitah     Singh  500000  2014-02-20 090000      Admin
4         5      Vivek     Bhati  500000  2014-06-11 090000      Admin
5         6      Vipul     Diwan  200000  2014-06-11 090000    Account
6         7     Satish     Kumar   75000  2014-01-20 090000    Account
7         8    Geetika   Chauhan   90000  2014-04-11 090000      Admin

In [44]:
df = pd.DataFrame(np.loadtxt('worker.txt',dtype='str',delimiter='\t'),columns=['worker_id','first_name','last_name','salary','joining_date','department'])

## Find workers and their corresponding information from the table with an even number for their worker id.

In [20]:
# the way to find remainder in python
print(1%2)
print(2%2)
print(3%2)
print(4%2)

1
0
1
0

In [45]:
# check the datatype of column before divide with 2
df['worker_id'].dtype

dtype('O')

In [49]:
# change the datatype of column from object into int
df['worker_id'].astype(int)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: worker_id, dtype: int32

In [50]:
# overwrite it with the existing 'worker_id' column
df['worker_id']= df['worker_id'].astype(int)

In [51]:
# divide the column with 2 and keep remainders
df['worker_id']%2

0    1
1    0
2    1
3    0
4    1
5    0
6    1
7    0
Name: worker_id, dtype: int32

In [52]:
# find an even number for their worker id
df['worker_id']%2==1

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7    False
Name: worker_id, dtype: bool

In [53]:
df[df['worker_id']%2==1]

   worker_id first_name last_name  salary       joining_date department
0          1     Monika     Arora  100000  2014-02-20 090000         HR
2          3     Vishal   Singhal  300000  2014-02-20 090000         HR
4          5      Vivek     Bhati  500000  2014-06-11 090000      Admin
6          7     Satish     Kumar   75000  2014-01-20 090000    Account